NextFOAM-2509/tutorials/incompressible/pimpleFoam/laminar/cylinder2D/system/DMDs/stdmd15
// -*- C++ -*-

stdmd15
{
    ${stdmd01}

    modeSorter      kiewat;
}


// ************************************************************************* //
